Kown-Minhyuk/RGB-IR_Controller/RGB_IR_INTEL_REV05/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Asclin/Lin/IfxAsclin_Lin.c
    if (asclin->receiveIdEnable)                       /* if receiving the sent id byte into its own Rx FIFO is selected*/
    {
        IfxAsclin_flushRxFifo(asclinSFR);              /* flushing Rx FIFO*/
        IfxAsclin_enableRxFifoInlet(asclinSFR, TRUE);  /* enabling Rx FIFO */
    }
    else
    {
        IfxAsclin_enableRxFifoInlet(asclinSFR, FALSE); /* disabling Rx FIFO */
    }

    IfxAsclin_flushTxFifo(asclinSFR);                  /* flushing Tx FIFO */
    IfxAsclin_enableTxFifoOutlet(asclinSFR, TRUE);     /* enabling Tx FIFO for transmitting*/
    IfxAsclin_write8(asclinSFR, id, 1U);               /* writing the ID byte */
    IfxAsclin_setTransmitHeaderRequestFlag(asclinSFR); /* setting THRQS flag */
    IfxAsclin_Lin_waitForTransmittedHeader(asclin);    /* waiting until transmit header end acknowledgemnet */
}


void IfxAsclin_Lin_sendResponse(IfxAsclin_Lin *asclin, uint8 *data, uint32 length)
{
    Ifx_ASCLIN *asclinSFR = asclin->asclin;              /* getting the pointer to ASCLIN registers from module handler*/
    IfxAsclin_setDataLength(asclinSFR, length - 1);      /* set number of bytes to be transfered */
    IfxAsclin_clearAllFlags(asclinSFR);                  /* clear all flags */
    IfxAsclin_flushTxFifo(asclinSFR);                    /* flushing Tx FIFO */
    IfxAsclin_enableRxFifoInlet(asclinSFR, FALSE);       /* disable Rx FIFO */
    IfxAsclin_enableTxFifoOutlet(asclinSFR, TRUE);       /* enable Tx FIFO for transmitting */
    IfxAsclin_write8(asclinSFR, data, length);           /* write the data bytes; */
    IfxAsclin_setTransmitResponseRequestFlag(asclinSFR); /* set TRRQS flag */
    IfxAsclin_Lin_waitForTransmittedResponse(asclin);    /* wait until transmit response end acknowledgemnet */
}


void IfxAsclin_Lin_waitForReceivedHeader(IfxAsclin_Lin *asclin)
{
	uint32 current_time = 0;
	uint32 sample_time = 0;
	uint32 Time_const = 10000000;	/* 500ms	*/

    IfxAsclin_Lin_clearFlagsStatus(asclin);     /* clear all aknowledgement and error flags status */

    /* wait until receive header end acknowledgemnet has been detected  */
    while (asclin->acknowledgmentFlags.rxHeaderEnd != 1)
    {
        IfxAsclin_Lin_checkForReceivedHeaderFlags(asclin);
    }
}


void IfxAsclin_Lin_waitForReceivedResponse(IfxAsclin_Lin *asclin)
{
	uint32 current_time = 0;
	uint32 sample_time = 0;
	uint32 Time_const = 10000000;	/* 500ms	*/

    IfxAsclin_Lin_clearFlagsStatus(asclin);     /* clear all aknowledgement and error flags status */

	sample_time = IfxStm_getLower(stmSfr3);
    /* wait until receive response end acknowledgemnet has been detected  */
    while (asclin->acknowledgmentFlags.rxResponseEnd != 1)
    {
        IfxAsclin_Lin_checkForReceivedResponseFlags(asclin);
        current_time = IfxStm_getLower(stmSfr3);
		if( current_time - sample_time >= Time_const )
		{
			sample_time += Time_const;
			break;
		}
    }
}


void IfxAsclin_Lin_waitForTransmittedHeader(IfxAsclin_Lin *asclin)
{
	uint32 current_time = 0;
	uint32 sample_time = 0;
	uint32 Time_const = 10000000;	/* 500ms	*/

    IfxAsclin_Lin_clearFlagsStatus(asclin);     /* clear all aknowledgement and error flags status */

	sample_time = IfxStm_getLower(stmSfr3);
    /* wait until transmit header end acknowledgemnet has been detected */
    while (asclin->acknowledgmentFlags.txHeaderEnd != 1)
    {
        IfxAsclin_Lin_checkForTransmittedHeaderFlags(asclin);
        current_time = IfxStm_getLower(stmSfr3);
		if( current_time - sample_time >= Time_const )
		{
			sample_time += Time_const;
			break;
		}
    }
}


void IfxAsclin_Lin_waitForTransmittedResponse(IfxAsclin_Lin *asclin)
{
	uint32 current_time = 0;
	uint32 sample_time = 0;
	uint32 Time_const = 10000000;	/* 500ms	*/

    IfxAsclin_Lin_clearFlagsStatus(asclin);     /* clear all aknowledgement and error flags status */

	sample_time = IfxStm_getLower(stmSfr3);
    /* wait until transmit response end acknowledgemnet has been detected */
    while (asclin->acknowledgmentFlags.txResponseEnd != 1)
    {
        IfxAsclin_Lin_checkForTransmittedResponseFlags(asclin);
        current_time = IfxStm_getLower(stmSfr3);
		if( current_time - sample_time >= Time_const )
		{
			sample_time += Time_const;
			break;
		}
    }
}


void Lin_send_Header_receive_Response(IfxAsclin_Lin *asclin, uint8 *id, uint8 *rxdata, uint32 length){
	Ifx_ASCLIN *asclinSFR = asclin->asclin;            /* getting the pointer to ASCLIN registers from module handler*/
	IfxAsclin_clearAllFlags(asclinSFR);                /* clearing all flags*/
	if (asclin->receiveIdEnable)                       /* if receiving the sent id byte into its own Rx FIFO is selected*/
	{
		IfxAsclin_flushRxFifo(asclinSFR);              /* flushing Rx FIFO*/
		IfxAsclin_enableRxFifoInlet(asclinSFR, TRUE);  /* enabling Rx FIFO */
	}
	else
	{
		IfxAsclin_flushRxFifo(asclinSFR);              /* flushing Rx FIFO */
		IfxAsclin_enableRxFifoInlet(asclinSFR, FALSE); /* disabling Rx FIFO */
	}
	IfxAsclin_flushTxFifo(asclinSFR);                  /* flushing Tx FIFO */
	IfxAsclin_enableTxFifoOutlet(asclinSFR, TRUE);     /* enabling Tx FIFO for transmitting*/
	IfxAsclin_write8(asclinSFR, id, 1U);               /* writing the ID byte */
	IfxAsclin_setTransmitHeaderRequestFlag(asclinSFR); /* setting THRQS flag */
	IfxAsclin_Lin_waitForTransmittedHeader(asclin);    /* waiting until transmit header end acknowledgemnet */
	IfxAsclin_setDataLength(asclinSFR, length - 1);   /* set number of bytes to be received*/
	IfxAsclin_enableTxFifoOutlet(asclinSFR, FALSE);   /* enable Tx FIFO for transmitting */
	IfxAsclin_enableRxFifoInlet(asclinSFR, TRUE);     /* enable Rx FIFO for receiving */
	IfxAsclin_Lin_waitForReceivedResponse(asclin);    /* wait until receive response end acknowledgemnet or an error is occured*/
	IfxAsclin_read8(asclinSFR, rxdata, length);         /* read the data bytes; */
}

